hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
// Minimum bytes a legal AX.25 UI frame header can be: destination address (6
// call + 1 SSID/control byte = 7), source address (7), control byte (1) and
// PID byte (1) = 16. This is a lower bound with zero repeaters. The
// destination and source addresses are the one stretch DECODE_CALL() walks
// with no further test, so anything shorter is rejected up front rather than
// read past the logical end of a short/corrupted RF frame; everything after
// them is measured against the frame length as it is reached.
#define AX25_MIN_ADDR_LEN (7 + 7 + 1 + 1)

// Size of one AX.25 address: 6 shifted callsign characters plus the SSID
// octet whose bit 0 is the address-extension bit. Each repeater the address
// field carries costs exactly this much, so it is what the walk below requires
// to still be inside the frame before decoding one more of them.
#define AX25_ADDR_LEN 7

// Bytes the control and PID fields take together, right after the last
// address. Both are read as fixed-width fields, so both have to fit.
#define AX25_CTRL_PID_LEN 2

bool ax25_decode(uint8_t *buf, size_t len, uint16_t mVrms, ax25_msg_t *msg, enum Ax25DecodeReason *reason) {
    if (reason)
        *reason = AX25_DECODE_MALFORMED; // default for every early return below; overwritten on the two well-formed-but-non-APRS paths and on success

    if (len < AX25_MIN_ADDR_LEN)
        return false; // too short to hold dst+src+ctrl+pid: reject before any fixed-width field parsing

    // One past the last byte the caller vouches for. Every read beyond the
    // fixed dst/src pair the length check above already covers is measured
    // against this, so the decoder's own safety does not depend on whoever
    // produced the buffer having stopped the address field at the right place.
    const uint8_t *end = buf + len;

    DECODE_CALL(buf, msg->dst.call);
    msg->dst.ssidBits = *buf++;
    msg->dst.ssid = (msg->dst.ssidBits >> 1) & 0x0F;
    msg->dst.call[6] = 0;

    DECODE_CALL(buf, msg->src.call);
    msg->src.ssidBits = *buf;
    msg->src.ssid = (msg->src.ssidBits >> 1) & 0x0F;
    msg->src.call[6] = 0;

    // Repeater walk. On entry to each pass buf points at the SSID octet of the
    // address just decoded, whose bit 0 is the extension bit: clear means one
    // more address follows. That byte and the seven bytes the promised address
    // needs are both demanded to be inside the frame before they are read, so a
    // header whose extension bits claim more addresses than its length can hold
    // is rejected here instead of decoding whatever bytes happen to follow it
    // in the caller's buffer.
    msg->rpt_count = 0;
    while (true) {
        if (buf >= end)
            return false; // extension bit claims another address past the end of the frame

        bool more = ((*buf++ & 0x01) == 0);
        if (!more || msg->rpt_count >= countof(msg->rpt_list))
            break;

        if ((size_t)(end - buf) < AX25_ADDR_LEN)
            return false; // not enough bytes left for the repeater address the extension bit promised

        DECODE_CALL(buf, msg->rpt_list[msg->rpt_count].call);
        msg->rpt_list[msg->rpt_count].ssidBits = *buf;
        msg->rpt_list[msg->rpt_count].ssid = (msg->rpt_list[msg->rpt_count].ssidBits >> 1) & 0x0F;
        AX25_SET_REPEATED(msg, msg->rpt_count, (*buf & 0x80));
        msg->rpt_list[msg->rpt_count].call[6] = 0;
        msg->rpt_count++;
    }

    if ((size_t)(end - buf) < AX25_CTRL_PID_LEN)
        return false; // address field consumed the frame, leaving no control and PID fields

    // The Poll/Final bit is the sender's business and carries no meaning for
    // the payload, so a UI frame is a UI frame with or without it. ctrl keeps
    // the byte as received.
    msg->ctrl = *buf++;
    if (!AX25_CTRL_IS_UI(msg->ctrl)) {
        if (reason)
            *reason = AX25_DECODE_NOT_UI; // well-formed frame, just not UI: legacy connected-mode AX.25 traffic on the channel
        return false;
    }

    msg->pid = *buf++;
    if (msg->pid != AX25_PID_NOLAYER3) {
        if (reason)
            *reason = AX25_DECODE_NOT_NOLAYER3; // well-formed UI frame, just not an APRS PID: non-APRS UI traffic on the channel
        return false;
    }

    if (reason)
        *reason = AX25_DECODE_OK;

    memset(msg->info, 0, sizeof(msg->info));
    int rest = (int)(end - buf);
    if (rest > 0) {
        if (rest > (int)sizeof(msg->info) - 1)
            rest = (int)sizeof(msg->info) - 1;
        msg->len = (size_t)rest;
        // memcpy, not strncpy: the info field may legally contain any byte
        memcpy(msg->info, buf, (size_t)rest);
    } else {
        msg->len = 0;
    }
    msg->mVrms = mVrms;
    return true;
}

#ifdef ENABLE_FX25
// @brief Roll rxBufferHead back after a failed FX.25 parse.
//
// Takes the start position as an argument rather than reading it back out of
// rxFrame[rxFrameHead].start: the handle for a frame in progress is not
// written until the frame has been validated, so there is nothing to read
// back, and passing the start position in avoids depending on rxFrameHead not
// having moved.
static void removeLastFrameFromRxBuffer(uint16_t start) {
    rxBufferHead = start;
}

static void *writeFx25Frame(const uint8_t *data, uint16_t size) {
    // Worst case: 2 flags, 2 CRC bytes and all the bits added by bitstuffing.
    // Bitstuffing occurs after 5 consecutive ones, so it can occupy up to
    // frame size / 5 additional bytes; +1 for the division remainder.
    const struct Fx25Mode *fx25Mode = Fx25GetModeForSize(size + 4 + (size / 5) + 1);
    uint16_t requiredSize;
    if (NULL != fx25Mode)
        requiredSize = fx25Mode->K + fx25Mode->T;
    else
        return NULL; // frame will not fit in FX.25

    if (ringByteSpace(txBufferHead, RING_OBSERVE(txBufferTail)) < requiredSize)
        return NULL; // it may still fit in standard AX.25

    txFrame[txFrameHead].size = requiredSize;
    txFrame[txFrameHead].start = txBufferHead;
    txFrame[txFrameHead].fx25Mode = (struct Fx25Mode *)fx25Mode;

    memset(txFx25Buffer, 0, sizeof(txFx25Buffer));

    uint16_t index = 0;
    txFx25Buffer[index++] = 0x7E; // header flag

    uint16_t crc = 0xFFFF;
    uint8_t bits = 0;
    uint8_t bitstuff = 0;

    for (uint16_t i = 0; i < size + 2; i++) {
        for (uint8_t k = 0; k < 8; k++) {
            txFx25Buffer[index] >>= 1;
            bits++;
            if (i < size) { // frame data
                if ((data[i] >> k) & 1) {
                    calculateCRC(1, &crc);
                    bitstuff++;
                    txFx25Buffer[index] |= 0x80;
                } else {
                    calculateCRC(0, &crc);
                    bitstuff = 0;
                }
            } else { // crc
                uint8_t c;
                if (i == size)
                    c = (crc & 0xFF) ^ 0xFF;
                else
                    c = (crc >> 8) ^ 0xFF;

                if ((c >> k) & 1) {
                    bitstuff++;
                    txFx25Buffer[index] |= 0x80;
                } else {
                    bitstuff = 0;
                }
            }

            if (bits == 8) {
                bits = 0;
                index++;
            }
            if (bitstuff == 5) {
                bits++;
                bitstuff = 0;
                txFx25Buffer[index] >>= 1;
                if (bits == 8) {
                    bits = 0;
                    index++;
                }
            }
        }
    }

    // pad with flags
    while (index < fx25Mode->K) {
        for (uint8_t k = 0; k < 8; k++) {
            txFx25Buffer[index] >>= 1;
            bits++;

            if ((0x7E >> k) & 1)
                txFx25Buffer[index] |= 0x80;

            if (bits == 8) {
                bits = 0;
                index++;
            }
        }
    }

    Fx25Encode(txFx25Buffer, sizeof(txFx25Buffer), fx25Mode);

    for (uint16_t i = 0; i < (fx25Mode->K + fx25Mode->T); i++) {
        txBuffer[txBufferHead++] = txFx25Buffer[i];
        txBufferHead %= FRAME_BUFFER_SIZE;
    }

    void *ret = &txFrame[txFrameHead];
    RING_PUBLISH(txFrameHead, RING_NEXT(txFrameHead)); // payload is in place
    return ret;
}

static struct FrameHandle *parseFx25Frame(const uint8_t *frame, uint16_t size, uint16_t *crc) {
    struct FrameHandle *h = &rxFrame[rxFrameHead];
    uint16_t initialRxBufferHead = rxBufferHead;
    uint8_t tempRxFrameHead = rxFrameHead;

    // Destuffing writes straight into rxBuffer before the output length is
    // known, so reserve the worst case (`size` bytes, i.e. no stuffing removed)
    // up front. Checking after the fact would be too late.
    if (!rxRingHasRoom(size))
        return NULL;

    uint16_t i = 0;
    uint16_t k = 0;
    while (frame[i] == 0x7E)
        i++;

    uint8_t bitstuff = 0;
    uint8_t outBit = 0;
    for (; i < size; i++) {
        for (uint8_t b = 0; b < 8; b++) {
            if (frame[i] & (1 << b)) {
                rxBuffer[rxBufferHead] >>= 1;
                rxBuffer[rxBufferHead] |= 0x80;
                bitstuff++;
            } else {
                if (bitstuff == 5) { // zero after 5 ones: normal bitstuffing
                    bitstuff = 0;
                    continue;
                } else if (bitstuff == 6) { // zero after 6 ones: this is a flag
                    goto endParseFx25Frame;
                } else if (bitstuff >= 7) { // zero after 7 ones: illegal byte
                    removeLastFrameFromRxBuffer(initialRxBufferHead);
                    return NULL;
                }
                bitstuff = 0;
                rxBuffer[rxBufferHead] >>= 1;
            }
            outBit++;
            if (outBit == 8) {
                k++;
                rxBufferHead++;
                rxBufferHead %= FRAME_BUFFER_SIZE;
                outBit = 0;
            }
        }
    }

endParseFx25Frame:
    // k is unsigned: without this, a runt block makes (k - 2) wrap to ~65534
    // and the CRC loop below walks the whole rxBuffer. A valid frame is at
    // least 17 bytes (addresses + control + FCS), same floor the plain HDLC
    // path applies.
    if (k < 17) {
        removeLastFrameFromRxBuffer(initialRxBufferHead);
        return NULL;
    }

    *crc = 0xFFFF;
    i = initialRxBufferHead;

    for (uint16_t j = 0; j < (k - 2); j++) {
        for (uint8_t b = 0; b < 8; b++)
            calculateCRC((rxBuffer[i] >> b) & 1, crc);

        i++;
        i %= FRAME_BUFFER_SIZE;
    }

    *crc ^= 0xFFFF;
    if ((rxBuffer[i] == (*crc & 0xFF)) && (rxBuffer[(i + 1) % FRAME_BUFFER_SIZE] == ((*crc >> 8) & 0xFF))) {
        uint16_t pathEnd = initialRxBufferHead;
        bool pathEndFound = false;
        for (uint16_t j = 0; j < (k - 2); j++) {
            if (rxBuffer[pathEnd] & 1) {
                pathEndFound = true;
                break;
            }
            pathEnd++;
            pathEnd %= FRAME_BUFFER_SIZE;
        }

        // a frame with no path-end bit before the CRC has no valid
        // control/PID field to inspect and is treated as invalid
        //
        // if non-APRS frames are not allowed, require a UI control field
        // (Poll/Final bit ignored) and the no-layer-3 PID
        if (pathEndFound && (Ax25Config.allowNonAprs || (AX25_CTRL_IS_UI(rxBuffer[(pathEnd + 1) % FRAME_BUFFER_SIZE]) &&
                                                         (rxBuffer[(pathEnd + 2) % FRAME_BUFFER_SIZE] == AX25_PID_NOLAYER3)))) {
            // The payload is already in rxBuffer at this point. Fill the handle,
            // and only then make it visible - the release store below is what
            // orders both against the consumer on the other core. The caller
            // still writes h->peak/level/corrected/fx25Mode after we return, so
            // publication is deferred to publishRxFrame().
            h->start = initialRxBufferHead;
            h->size = k - 2;
            (void)tempRxFrameHead; // rxFrameHead is advanced by publishRxFrame()
            return h;
        }
    }

    removeLastFrameFromRxBuffer(initialRxBufferHead);
    return NULL;
}

// @brief Make the handle parseFx25Frame() just filled visible to the consumer.
//
// Split out because the FX.25 caller decorates the handle (signal level, FEC
// byte count, mode) after the parse returns. Publishing here, rather than
// advancing rxFrameHead inside the parser, keeps the slot invisible to the
// consumer until those fields have been written.
static void publishRxFrame(void) {
    RING_PUBLISH(rxFrameHead, RING_NEXT(rxFrameHead));
}
#endif // ENABLE_FX25

void *Ax25WriteTxFrame(const uint8_t *data, uint16_t size) {
    // Consumed by Ax25GetTxBit() in the DAC sample-clock ISR, on another core.
    if (RING_NEXT(txFrameHead) == RING_OBSERVE(txFrameTail)) {
        ESP_LOGW(TAG, "TX buffer full, frame dropped (%u bytes)", size);
        return NULL;
    }

#ifdef ENABLE_FX25
    if (Ax25Config.fx25 && Ax25Config.fx25Tx) {
        void *ret = writeFx25Frame(data, size);
        if (ret)
            return ret;
    }
#endif

