hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
    dedupClose();
    dedupOpen = true;
    lastCrc = crc;
    lastCrcMask = (uint8_t)(1u << modem);
    rxMultiplexDelay = 0;
    return true;
}

// @brief CRC-16/X.25 of len bytes, final inversion applied, as carried in the
//        FCS.
static uint16_t frameCrc(const uint8_t *data, uint16_t len) {
    uint16_t crc = 0xFFFF;
    for (uint16_t i = 0; i < len; i++) {
        for (uint8_t k = 0; k < 8; k++)
            calculateCRC((data[i] >> k) & 1, &crc);
    }
    return crc ^ 0xFFFF;
}

// @brief Strict APRS plausibility test, applied to repaired frames only.
//
// A repair that matches the FCS but lands on the wrong bits leaves a frame
// with two errors; the checks below reject most of those. len excludes the
// FCS.
static bool framePlausible(const uint8_t *f, uint16_t len) {
    uint16_t idx = 0;
    uint8_t addresses = 0;

    for (;;) {
        if ((uint16_t)(idx + 7) > len)
            return false;

        bool spaceSeen = false;
        for (uint8_t j = 0; j < 6; j++) {
            uint8_t c = f[idx + j];
            if (c & 1)
                return false; // address characters never carry the extension bit
            char ch = (char)(c >> 1);
            bool alnum = (ch >= 'A' && ch <= 'Z') || (ch >= '0' && ch <= '9');
            if (ch == ' ') {
                if (j == 0)
                    return false; // a callsign never starts with padding
                spaceSeen = true;
            } else if (!alnum || spaceSeen) {
                return false; // invalid character, or a character after the padding
            }
        }

        bool last = (f[idx + 6] & 1) != 0;
        idx += 7;
        addresses++;
        if (last)
            break;
        if (addresses >= 2 + AX25_MAX_RPT)
            return false;
    }

    if (addresses < 2 || (uint16_t)(idx + 2) > len)
        return false;
    if (!AX25_CTRL_IS_UI(f[idx]) || f[idx + 1] != AX25_PID_NOLAYER3)
        return false;

    for (uint16_t i = idx + 2; i < len; i++) {
        uint8_t b = f[i];
        if (b < 0x1C && b != 0x0D && b != 0x0A)
            return false;
    }
    return true;
}

// @brief Try to make a frame's FCS match by flipping one symbol's worth of
//        bits.
//
// The CRC is affine over GF(2): the register after running over a corrupted
// frame and its FCS equals AX25_CRC_GOOD_RESIDUE XOR a syndrome that depends
// only on the error pattern. The syndrome of one wrong bit at position p
// (bits counted in transmission order, len * 8 in total) is the register
// state a lone 1 at p leaves after the zeros that follow it; walking p from
// the last bit backwards, each step is one zero-input CRC step of the
// previous syndrome. Every candidate - an adjacent pair, and at level 2 also a
// single bit - is compared against the measured syndrome in one pass.
//
// @param frame Frame bytes including the two FCS bytes; corrected in place
//              when the repair is accepted.
// @param len   Length of frame, FCS included.
// @param level Repair level, 1 or 2 (see Ax25SetFixBits()).
// @return Number of bits flipped, or 0 if the frame was left unchanged.
static uint8_t repairFrame(uint8_t *frame, uint16_t len, uint8_t level) {
    uint16_t reg = 0xFFFF;
    for (uint16_t i = 0; i < len; i++) {
        for (uint8_t k = 0; k < 8; k++)
            calculateCRC((frame[i] >> k) & 1, &reg);
    }

    const uint16_t syndrome = reg ^ AX25_CRC_GOOD_RESIDUE;
    if (syndrome == 0)
        return 0;

    const int32_t bits = (int32_t)len * 8;
    uint16_t s = 0x8408; // syndrome of an error in the last bit
    uint16_t next = 0;   // syndrome of an error in the bit after the current one
    int32_t found = -1;
    uint8_t width = 0;
    uint8_t matches = 0;

    for (int32_t p = bits - 1; p >= 0; p--) {
        if ((p < bits - 1) && ((uint16_t)(s ^ next) == syndrome)) {
            matches++;
            found = p;
            width = 2;
        }
        if ((level >= 2) && (s == syndrome)) {
            matches++;
            found = p;
            width = 1;
        }

        next = s;
        calculateCRC(0, &s);
    }

    // Two candidates explaining the same syndrome are indistinguishable, so
    // neither is trusted.
    if (matches != 1)
        return 0;

    for (uint8_t b = 0; b < width; b++) {
        int32_t q = found + b;
        frame[q >> 3] ^= (uint8_t)(1u << (q & 7));
    }

    if (framePlausible(frame, (uint16_t)(len - 2)))
        return width;

    for (uint8_t b = 0; b < width; b++) {
        int32_t q = found + b;
        frame[q >> 3] ^= (uint8_t)(1u << (q & 7));
    }
    return 0;
}

// @brief Handle a plain AX.25 frame closed by a flag: check (and optionally
//        repair) the FCS, drop duplicates and publish the frame.
static void rxFrameEnd(struct RxState *rx, uint8_t modem, uint16_t mV) {
    uint8_t repaired = 0;

    rx->crc ^= 0xFFFF;
    bool fcsOk = (rx->frame[rx->frameIdx - 2] == (rx->crc & 0xFF)) && (rx->frame[rx->frameIdx - 1] == ((rx->crc >> 8) & 0xFF));

    if (!fcsOk) {
        // A repair is only worth trying when no other demodulator has just
        // delivered this frame intact.
        if ((rxFixBits == 0) || dedupOpen)
            return;
        repaired = repairFrame(rx->frame, rx->frameIdx, rxFixBits);
        if (repaired == 0)
            return;
        rx->crc = frameCrc(rx->frame, (uint16_t)(rx->frameIdx - 2));
    }

    uint16_t i = 13; // start at the SSID of the source
    bool pathEndFound = false;
    for (; i < (rx->frameIdx - 2); i++) {
        if (rx->frame[i] & 1) { // path end bit
            pathEndFound = true;
            break;
        }
    }

    // a frame with no path-end bit before the CRC has no valid control/PID
    // field to inspect and is treated as invalid
    //
    // if non-APRS frames are not allowed, require a UI control field
    // (Poll/Final bit ignored) and the no-layer-3 PID
    if (!pathEndFound || (uint16_t)(i + 2) >= rx->frameIdx)
        return;
    if (!Ax25Config.allowNonAprs && (!AX25_CTRL_IS_UI(rx->frame[i + 1]) || (rx->frame[i + 2] != AX25_PID_NOLAYER3)))
        return;

