hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
    rx->frameIdx -= 2; // remove CRC

    if (!dedupAccept(rx->crc, modem))
        return;

    if (!rxRingHasRoom(rx->frameIdx)) {
        ESP_LOGW(TAG, "RX frame buffer full, frame dropped");
        return;
    }

    // Order matters. The service task consumes this slot from a different
    // task, on a different core, with no lock and no barrier other than the
    // release/acquire pair below, so the payload must be fully in rxBuffer
    // before the slot is made visible. Otherwise the consumer could copy the
    // frame out before, or while, it was written and hand up a mix of the new
    // frame and whatever the ring still held.
    //
    // Payload first, then the handle, then one release store to publish the
    // slot. Nothing before the release can be reordered past it, and the
    // consumer's matching acquire load guarantees it sees all of it.
    uint8_t slot = rxFrameHead;
    uint16_t start = rxBufferHead;

    for (uint16_t j = 0; j < rx->frameIdx; j++) {
        rxBuffer[rxBufferHead++] = rx->frame[j];
        rxBufferHead %= FRAME_BUFFER_SIZE;
    }

    rxFrame[slot].start = start;
    rxFrame[slot].size = rx->frameIdx;
    rxFrame[slot].mVrms = mV;
    rxFrame[slot].demod = modem;
    rxFrame[slot].twistDb = ModemGetTwistDb(modem);
    rxFrame[slot].repaired = repaired;
    ModemGetSignalLevel(modem, &rxFrame[slot].peak, &rxFrame[slot].valley, &rxFrame[slot].level);
#ifdef ENABLE_FX25
    rxFrame[slot].fx25Mode = NULL;
#endif
    rxFrame[slot].corrected = AX25_NOT_FX25;

    RING_PUBLISH(rxFrameHead, RING_NEXT(slot));

    rxStats.delivered++;
    if (repaired)
        rxStats.repaired++;
}

void Ax25BitParse(uint8_t bit, uint8_t modem, uint16_t mV) {
    if (dedupOpen) { // a frame was received
        rxMultiplexDelay++;
        if (rxMultiplexDelay > (uint16_t)(RX_DEDUP_HOLD_BITS * ModemGetDemodulatorCount())) {
            // hold it for a while and wait for the other decoders to receive it
            dedupClose();
        }
    }

    struct RxState *rx = &rxState[modem];

    rx->rawData <<= 1;
    rx->rawData |= (bit > 0);

#ifdef ENABLE_FX25
    rx->tag >>= 1;
    if (bit)
        rx->tag |= 0x8000000000000000ULL;

    // The correlation tag is sent right after the preamble flags, so a whole
    // tag can only be in the shift register while at most its own eight bytes
    // have been collected since the last flag. Further into a frame a match is
    // payload that happens to sit within the tag's tolerance, and following it
    // would abandon a frame that is being received correctly.
    if (Ax25Config.fx25 && (rx->rx != RX_STAGE_FX25_FRAME) && (rx->frameIdx <= (FX25_TAG_LEN)) &&
        (NULL != (rx->fx25Mode = (struct Fx25Mode *)Fx25GetModeForTag(rx->tag)))) {
        rx->rx = RX_STAGE_FX25_FRAME;
        rx->receivedByte = 0;
        rx->receivedBitIdx = 0;
        rx->frameIdx = 0;
        return;
    }

    if (rx->rx != RX_STAGE_FX25_FRAME) {
#endif

        if (rx->rawData == 0x7E) { // HDLC flag received
            // a correct frame is at least 17 bytes (source+destination+control+CRC)
            if ((rx->rx == RX_STAGE_FRAME) && (rx->frameIdx >= 17))
                rxFrameEnd(rx, modem, mV);
            rx->rx = RX_STAGE_FLAG;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            rx->crc = 0xFFFF;
            return;
        } else {
            rx->rx = RX_STAGE_FRAME;
        }

        // we're inside "rx->rx != RX_STAGE_FX25_FRAME", so we're not in the middle
        // of an actual FX.25 parity/tag block - safe to check for abort here
        if ((rx->rawData & 0x7F) == 0x7F) { // 7 consecutive ones: error
            rx->rx = RX_STAGE_IDLE;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            rx->crc = 0xFFFF;
            return;
        }
        if ((rx->rawData & 0x3F) == 0x3E) // dismiss the 0 added by bit stuffing
            return;
#ifdef ENABLE_FX25
    }
#endif

    if (rx->rawData & 0x01) // received a 1
        rx->receivedByte |= 0x80;

    if (++rx->receivedBitIdx >= 8) { // received a full byte
        if (rx->frameIdx >= 2) {
            for (uint8_t k = 0; k < 8; k++)
                calculateCRC((rx->frame[rx->frameIdx - 2] >> k) & 1, &(rx->crc));
        }

#ifdef ENABLE_FX25
        // end of FX.25 reception, that is, a full block received
        if ((rx->fx25Mode != NULL) && (rx->frameIdx == (rx->fx25Mode->K + rx->fx25Mode->T))) {
            uint8_t fixed = 0;
            bool fecSuccess = Fx25Decode(rx->frame, sizeof(rx->frame), rx->fx25Mode, &fixed);
            uint16_t crc;
            struct FrameHandle *h = parseFx25Frame(rx->frame, rx->frameIdx, &crc);
            if (h != NULL) {
                if (!dedupAccept(crc, modem)) {
                    // another demodulator's copy of a frame already delivered
                    removeLastFrameFromRxBuffer(h->start);
                } else {
                    ModemGetSignalLevel(modem, &h->peak, &h->valley, &h->level);
                    if (fecSuccess) {
                        h->corrected = fixed;
                        h->fx25Mode = rx->fx25Mode;
                    } else {
                        h->corrected = AX25_NOT_FX25;
                    }
                    h->mVrms = mV; // input level the service task reports for this frame
                    h->demod = modem;
                    h->twistDb = ModemGetTwistDb(modem);
                    h->repaired = 0;
                    publishRxFrame(); // handle complete - now make the slot visible
                    rxStats.delivered++;
                }
            }
            // on failure parseFx25Frame() already cleaned up the buffer state
            rx->rx = RX_STAGE_FLAG;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            // Drop the mode: it is the only thing arming the block-complete
            // test above, so it must not outlive the block that has just been
            // consumed. A stale pointer here would re-arm that test against a
            // plain HDLC frame that happens to reach K+T bytes.
            rx->fx25Mode = NULL;
            rx->crc = 0xFFFF;
            return;
        }
#else
        rx->rx = RX_STAGE_FRAME;
#endif
        if (rx->frameIdx >= (uint16_t)sizeof(rx->frame)) { // frame too long
            rx->rx = RX_STAGE_IDLE;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            rx->crc = 0xFFFF;
            return;
        }
        rx->frame[rx->frameIdx++] = rx->receivedByte;
        rx->receivedByte = 0;
        rx->receivedBitIdx = 0;
    } else {
        rx->receivedByte >>= 1;
    }
}

// @brief DAC-ISR side: retire the frame at txFrameTail and hand its bytes back.
//
// Releases exactly the bytes of the frame that actually finished, rather than
// advancing the byte tail to txBufferHead at the end of the whole
// transmission: txBufferHead is an index the producer owns, and freeing up to
// it could release a frame that Ax25WriteTxFrame() has only just written and
// that has not been sent yet.
static inline void IRAM_ATTR txRetireFrame(void) {
    const struct FrameHandle *h = &txFrame[txFrameTail];
    RING_PUBLISH(txBufferTail, (uint16_t)((h->start + h->size) % FRAME_BUFFER_SIZE));
    RING_PUBLISH(txFrameTail, RING_NEXT(txFrameTail));
    txFramesSentCount++; // plain store; single writer (this ISR), polled elsewhere
}

