hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
uint8_t IRAM_ATTR Ax25GetTxBit(void) {
    if (txBitIdx == 8) {
        txBitIdx = 0;
        if (txStage == TX_STAGE_PREAMBLE) { // transmitting the preamble (TXDelay)
            if (txDelayElapsed < txDelay) {
                txByte = SYNC_BYTE;
                txDelayElapsed++;
            } else {
                txDelayElapsed = 0;
#ifdef ENABLE_FX25
                if (NULL != txFrame[txFrameTail].fx25Mode) {
                    txStage = TX_STAGE_CORRELATION_TAG;
                    txTagByteIdx = 0;
                } else
#endif
                    txStage = TX_STAGE_HEADER_FLAGS;
            }
        }
#ifdef ENABLE_FX25
        if (txStage == TX_STAGE_CORRELATION_TAG) { // FX.25 correlation tag
            if (txTagByteIdx < 8)
                txByte = (txFrame[txFrameTail].fx25Mode->tag >> (8 * txTagByteIdx)) & 0xFF;
            else
                txStage = TX_STAGE_DATA;

            txTagByteIdx++;
        }
#endif
        if (txStage == TX_STAGE_HEADER_FLAGS) {
            if (txFlagsElapsed < STATIC_HEADER_FLAG_COUNT) {
                txByte = 0x7E;
                txFlagsElapsed++;
            } else {
                txFlagsElapsed = 0;
                txStage = TX_STAGE_DATA;
            }
        }
        if (txStage == TX_STAGE_DATA) {
            if (txFrameTail != RING_OBSERVE(txFrameHead)) {
                if (txByteIdx < txFrame[txFrameTail].size) {
                    txByte = txBuffer[(txFrame[txFrameTail].start + txByteIdx) % FRAME_BUFFER_SIZE];
                    txByteIdx++;
                }
#ifdef ENABLE_FX25
                else if (txFrame[txFrameTail].fx25Mode != NULL) {
                    txRetireFrame();
                    // Same one-frame-per-key-up rule as the AX.25 footer-flags
                    // path below: end this key-up here rather than chaining
                    // into whatever is next in the ring (another FX.25 block
                    // or a plain AX.25 frame). Ax25TransmitCheck() will start
                    // a fresh, separately-preambled transmission for it on
                    // its next tick if the ring is still non-empty.
                    goto transmitTail;
                }
#endif
                else {
                    txStage = TX_STAGE_CRC;
                    txCrcByteIdx = 0;
                }
            } else { // no more frames
#ifdef ENABLE_FX25
            transmitTail:
#endif
                txByteIdx = 0;
                txBitIdx = 0;
                txStage = TX_STAGE_TAIL;
            }
        }
        if (txStage == TX_STAGE_CRC) {
            if (txCrcByteIdx <= 1) {
                txByte = (txCrc & 0xFF) ^ 0xFF;
                txCrc >>= 8;
                txCrcByteIdx++;
            } else {
                txCrc = 0xFFFF;
                txStage = TX_STAGE_FOOTER_FLAGS;
                txFlagsElapsed = 0;
            }
        }
        if (txStage == TX_STAGE_FOOTER_FLAGS) {
            if (txFlagsElapsed < STATIC_FOOTER_FLAG_COUNT) {
                txByte = 0x7E;
                txFlagsElapsed++;
            } else {
                txFlagsElapsed = 0;
                txRetireFrame();
                // Always drop to the tail/PTT-off here instead of chaining
                // straight into the next queued frame's header. Chaining would
                // let several ring-buffered packets go out back-to-back inside
                // a single uninterrupted key-up: no PTT toggle, no fresh
                // TXDelay preamble and no per-frame quiet-time/CSMA check
                // between them.
                //
                // Ending the key-up here means every frame - including a
                // second or third one already sitting in the ring - gets its
                // own transmitStart() (own preamble, own "PTT ON" log line)
                // once Ax25TransmitCheck() sees the ring still non-empty on
                // its next tick, so packets go out one at a time with a real
                // PTT-off in between.
                txByteIdx = 0;
                txBitIdx = 0;
                txStage = TX_STAGE_TAIL;
            }
        }
        if (txStage == TX_STAGE_TAIL) {
            if (txTailElapsed < txTail) {
                txByte = SYNC_BYTE;
                txTailElapsed++;
            } else { // tail transmitted, stop
                txTailElapsed = 0;
                txStage = TX_STAGE_IDLE;
                txCrc = 0xFFFF;
                txBitstuff = 0;
                txByte = 0;
                txInitStage = TX_INIT_OFF;
                // txBufferTail is released per frame by txRetireFrame(), so
                // there is deliberately no bulk reset of it here.
                ModemTransmitStop();
                txJustKeyedDown = true; // plain store; polled by Ax25TransmitCheck()
                return 0;
            }
        }
    }

    uint8_t txBit = 0;
    // normal data or CRC in AX.25 mode
    if (
#ifdef ENABLE_FX25
        (NULL == txFrame[txFrameTail].fx25Mode) &&
#endif
        ((txStage == TX_STAGE_DATA) || (txStage == TX_STAGE_CRC))) {
        if (txBitstuff == 5) { // 5 consecutive ones transmitted
            txBit = 0;         // transmit a bit-stuffed 0
            txBitstuff = 0;
        } else {
            if (txByte & 1) {
                txBitstuff++;
                txBit = 1;
            } else {
                txBit = 0;
                txBitstuff = 0;
            }
            if (txStage == TX_STAGE_DATA) // CRC only over normal data
                calculateCRC(txByte & 1, &txCrc);

            txByte >>= 1;
            txBitIdx++;
        }
    } else {
        // FX.25 mode, or AX.25 preamble/flags: no CRC, no bit stuffing
        txBit = txByte & 1;
        txByte >>= 1;
        txBitIdx++;
    }
    return txBit;
}

void Ax25TransmitBuffer(void) {
    if (txInitStage == TX_INIT_WAITING)
        return;
    if (txInitStage == TX_INIT_TRANSMITTING)
        return;

    if (RING_OBSERVE(txFrameHead) != txFrameTail) {
        // In full duplex there is no reason to wait at all.
        txQuiet = millis() + (Ax25Config.fullDuplex ? 0 : Ax25Config.quietTime);
        txInitStage = TX_INIT_WAITING;
    }
}

// @brief Log "PTT ON" together with the actual content of the frame that is
// about to key up, decoded back into a readable TNC2 line
// ("SRC>DST,PATH:info"), instead of a fixed placeholder string.
//
// txFrameTail still points at that frame here: transmitStart() runs before
// the DAC ISR has clocked out a single bit of it, so txRetireFrame() (which
// advances txFrameTail) has not run yet. Skipped entirely when INFO logging
// is off for this tag, same as the TX-queued log, so it costs nothing then.
static void logPttOn(void) {
    if (esp_log_level_get(TAG) < ESP_LOG_INFO) {
        return;
    }

    // Diagnostic: print the ACTUAL measured gap since the last "PTT OFF"
    // against the currently configured minimum, so a log capture proves
    // (or disproves) that the unkey hold was really honored - rather than
    // trusting the gating logic above this function without evidence.
    // Skipped on the very first transmission since boot (txLastUnkeyMillis
    // still 0).
    if (txLastUnkeyMillis != 0) {
        uint32_t gap = millis() - txLastUnkeyMillis;
        ESP_LOGI(TAG, "unkey gap was %" PRIu32 " ms (configured minimum: %u ms)", gap, (unsigned)Ax25Config.minUnkeyTime);
    }

    const struct FrameHandle *h = &txFrame[txFrameTail];

#ifdef ENABLE_FX25
    if (NULL != h->fx25Mode) {
        // FX.25-encoded bytes (Reed-Solomon block) are not a plain AX.25
        // frame, so there is nothing meaningful for ax25_decode() to read.
        ESP_LOGI(TAG, "PTT ON (keyed up)");
        return;
    }
#endif

    uint16_t len = h->size;
    if (len > AX25_FRAME_MAX_SIZE) // cannot happen; do not overrun if it does
        len = AX25_FRAME_MAX_SIZE;

    for (uint16_t i = 0; i < len; i++)
        txLogBuffer[i] = txBuffer[(h->start + i) % FRAME_BUFFER_SIZE];

    ax25_msg_t decoded;
    if (ax25_decode(txLogBuffer, len, 0, &decoded, NULL)) {
        char tnc2[256];
        modem_format_tnc2(&decoded, tnc2, sizeof(tnc2));
        ESP_LOGI(TAG, "PTT ON (keyed up) - %s", tnc2);
    } else {
        ESP_LOGI(TAG, "PTT ON (keyed up)");
    }
}

