hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
// @brief Start transmission immediately.
// @warning Transmission must be initialized via Ax25TransmitBuffer().
static void transmitStart(void) {
    txCrc = 0xFFFF;
    txStage = TX_STAGE_PREAMBLE;
    txByte = 0;
    txBitIdx = 0;
    txFlagsElapsed = 0;
    txDelayElapsed = 0;
    ModemTransmitStart();
    logPttOn();
}

// @brief Poll for TX events raised by the DAC ISR and log them.
//
// The ISR (Ax25GetTxBit(), via txRetireFrame() and the TX_STAGE_TAIL
// completion) only sets plain flags/counters - it must not call ESP_LOGx
// itself, since that runs far too much code (and can block) to be safe at
// DAC-sample-clock priority. This runs once per Ax25TransmitCheck() call,
// which happens every service-task tick in ordinary task context, so it is
// safe to log from here instead.
static void pollTxEvents(void) {
    static uint32_t lastReportedSentCount = 0;
    uint32_t sent = txFramesSentCount; // single writer (ISR); safe plain read here
    while (lastReportedSentCount != sent) {
        lastReportedSentCount++;
        // Every frame gets its own key-up: the footer-flags and FX.25
        // retirement paths in Ax25GetTxBit() both end the transmission at
        // TX_STAGE_TAIL rather than chaining into the next queued frame, so
        // one "PTT ON"/"PTT OFF" pair bounds exactly one packet. The count
        // printed here is the backlog left immediately after retiring this
        // frame, so a 3-buffer backlog is seen draining 2, 1, 0 across
        // consecutive lines, one PTT cycle each.
        ESP_LOGI(TAG, "Packet sent [%u buffer(s) still awaiting]", (unsigned)Ax25TxFramesPending());
    }

    if (txJustKeyedDown) {
        txJustKeyedDown = false;
        // The PTT GPIO is dropped synchronously at key-down, inside the DAC
        // ISR's setTransmit(false) (only the ISR-safe gpio_set_level part; the
        // heavier teardown stays deferred to AFSK_ServiceTx()). txJustKeyedDown
        // is stored right after that pin drop, in the same ISR, so by the time
        // this poll observes it the PTT line is already idle - the log can fire
        // immediately and still sit in step with the real GPIO. This mirrors
        // "PTT ON (keyed up)", which is likewise logged right after setPtt(true)
        // drives the pin active.
        ESP_LOGI(TAG, "PTT OFF (unkeyed)");

        txLastUnkeyMillis = millis(); // for the gap print in logPttOn()
        txReleaseHoldoff = true;      // hold the next key-up off for one tick
        if (Ax25Config.minUnkeyTime > 0)
            txMinUnkeyUntil = millis() + Ax25Config.minUnkeyTime;
    }
}

// Anti-starvation floor: MAX_TRANSMIT_RETRY_COUNT slots have gone by without
// the queued frame keying up, so transmit it now rather than let it wait
// indefinitely. The run is attributed to whichever condition actually held it
// back: a single busy slot anywhere in the run means the channel was occupied
// and the frame is going out on top of somebody else's traffic, which is a
// congestion report; a run made up entirely of clear slots means every
// persistence roll missed, which says nothing about the channel and only that
// Ax25Config.persist is low (or luck was bad). Separating them keeps the
// clear-channel figure the operator sees from absorbing every congested
// key-up as well.
static void forceTransmit(void) {
    if (txBusySlots > 0) {
        ESP_LOGI(TAG, "Channel busy for %u of %u slots, transmitting anyway", txBusySlots, txRetries);
        txChannelBusyCount++;
    } else {
        ESP_LOGI(TAG, "Persistence check missed %u times on a clear channel, transmitting anyway", txRetries);
        txPersistenceMissedCount++;
    }
    txInitStage = TX_INIT_TRANSMITTING;
    txRetries = 0;
    txBusySlots = 0;
    transmitStart();
}

void Ax25TransmitCheck(void) {
    pollTxEvents();

    // A key-down was just logged this tick: the PTT GPIO was released at
    // key-down (in the DAC ISR) and pollTxEvents() has now emitted "PTT OFF
    // (unkeyed)". Returning here for one tick guarantees the pin stays low
    // long enough to be a real un-key before any queued frame can key up
    // again. AFSK_ServiceTx() runs just before this in the same service tick
    // and clears the pending-teardown flag, so the ModemTxTeardownPending()
    // guard below does not block an immediate re-key on its own; this one-tick
    // holdoff keeps the next frame's transmitStart() -> setPtt(true) from
    // firing microseconds after the "PTT OFF" line.
    if (txReleaseHoldoff) {
        txReleaseHoldoff = false;
        return;
    }

    // User-configurable extra unkey hold (Ax25Config.minUnkeyTime, 0 by
    // default): millis() is unsigned and wraps every ~49.7 days, so this
    // comparison uses subtraction rather than a plain "<" against the
    // deadline - (int32_t)(txMinUnkeyUntil - millis()) stays correctly signed
    // across a wraparound, whereas a direct millis() < txMinUnkeyUntil
    // compare would not.
    if ((int32_t)(txMinUnkeyUntil - millis()) > 0)
        return;

    // The previous key-up's PTT release happens in AFSK_ServiceTx(), in task
    // context, one modem-service-loop tick after the DAC ISR requests it
    // (setTransmit(false) can only raise a flag from ISR context). Until that
    // teardown has actually run, transmitStart() must not fire again: it
    // calls setTransmit(true), whose side effect of clearing the
    // pending-teardown flag would make AFSK_ServiceTx() skip the PTT release
    // for the frame that just finished entirely - so PTT would stay
    // continuously asserted across what are otherwise two properly separated
    // keyups (own preamble, own PTT-ON log, etc.). Waiting here for one extra
    // tick guarantees a real, visible PTT-off between every frame.
    if (ModemTxTeardownPending())
        return;

    if (txInitStage == TX_INIT_OFF) {
        // Nothing keyed up right now. There may still be one or more frames
        // left in the ring though: each frame runs its own complete
        // preamble/data/CRC/footer/PTT-off cycle and frames are never chained
        // together inside a single key-up (see the TX_STAGE_FOOTER_FLAGS and
        // FX.25 TX_STAGE_DATA retirement paths in Ax25GetTxBit()), so nothing
        // re-arms txInitStage for the next queued frame on its own. Ax25TransmitBuffer() is a no-op unless
        // txInitStage is TX_INIT_OFF and the ring is non-empty, so it is
        // always safe to call from here every tick.
        Ax25TransmitBuffer();
        if (txInitStage == TX_INIT_OFF) // still nothing to transmit
            return;
    }
    if (txInitStage == TX_INIT_TRANSMITTING) // already transmitting
        return;

