hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
        j = 0;
        for (i = p + 1; i < size && j < sizeof(num) - 1; i++) { // SSID
            if (txt[i] < 0x30)
                break;
            if (txt[i] > 0x39)
                break;
            num[j++] = txt[i];
        }
        if (j > 0)
            hdr->ssid = (char)atoi(num);

        hdr->ssid <<= 1;
    } else {
        for (i = 0; i < size && i < 6; i++) {
            if (txt[i] == '*')
                break;
            if (txt[i] == ',')
                break;
            if (txt[i] == ':')
                break;
            hdr->addr[i] = txt[i];
        }
        hdr->ssid = 0;
    }
    p = strpos(txt, '*');
    if (p > 0 && p < size)
        hdr->ssid |= 0x80;
    hdr->ssid |= 0x60;
}

char ax25_encode(ax25_frame_t *frame, char *txt, int size) {
    char *token;
    char *save;
    int i, hop;
    unsigned int p, p2, p3, j;

    memset(frame, 0, sizeof(ax25_frame_t));

    if (txt == NULL || size <= 0)
        return 0;

    // A TNC2 line is "SRC>DST[,PATH]:info": the information field starts right
    // after the first ':', the source call ends at the first '>' and the
    // destination call spans from there to either the first ',' of the
    // digipeater path or that same ':'.
    //
    // Every one of these offsets is a byte position into a line that may be up
    // to AX25_FRAME_MAX_SIZE bytes long, so all four are held in unsigned int:
    // a narrower type would wrap on the far half of a long line and hand
    // convPath() a start/size pair describing a field that is not there.
    p = strpos(txt, ':');
    if (p == 0 || p >= (unsigned int)size)
        return 0;

    p2 = strpos(txt, '>');
    if (p2 == 0 || p2 >= p)
        return 0;

    // payload
    memset(frame->data, 0, sizeof(frame->data));
    for (i = 0; i < (size - (int)p) - 1 && i < (int)sizeof(frame->data) - 1; i++)
        frame->data[i] = txt[p + i + 1];

    convPath(&frame->header[1], &txt[0], p2); // source callsign

    // strpos() scans the whole line, so a ',' inside the information field
    // reports an offset past the header, and one inside the source call
    // reports an offset before the destination field even begins. Both are
    // clamped to the ':' offset, which makes the destination field run to the
    // end of the header and leaves the digipeater path empty.
    j = strpos(txt, ',');
    if (j <= p2 || j > p)
        j = p;

    convPath(&frame->header[0], &txt[p2 + 1], j - p2 - 1); // destination

    p3 = 0;
    if (j < p) { // digipeater path present
        for (i = (int)j; i < size; i++) {
            if (txt[i] == ':') {
                for (; i < size; i++)
                    txt[p3++] = 0x00;
                break;
            }
            txt[p3++] = txt[i];
        }
        // strtok_r keeps the tokenizer state in this call frame, so two tasks
        // encoding at the same time cannot resume each other's scan.
        token = strtok_r(txt, ",", &save);
        hop = 0;
        while (token != NULL && hop < 8) {
            convPath(&frame->header[hop + 2], token, (unsigned int)strlen(token));
            token = strtok_r(NULL, ",", &save);
            hop++;
        }
    }

    for (i = 0; i < 10; i++)
        frame->header[i].ssid &= 0xFE; // clear all end-of-path bits
    // fix the end-of-path bit
    for (i = 2; i < 10; i++) {
        if (frame->header[i].addr[0] == 0x00) {
            frame->header[i - 1].ssid |= 0x01;
            break;
        }
    }
    return 1;
}

static void ax25_putRaw(uint8_t *raw, ax25_ctx_t *ctx, uint8_t c) {
    // No byte-level escaping here. The real HDLC bit-stuffing (insert a 0 bit
    // after five consecutive 1 bits) is done later, per bit, in Ax25GetTxBit().
    // Byte-level escaping here would inject a spurious 0x1B whenever a header
    // byte equalled 0x7E/0x7F/0x1B (e.g. SSID 15 encodes to 0x7E), corrupting
    // the transmitted frame.
    ctx->crc_out = update_crc_ccit(c, ctx->crc_out);
    *raw = c;
}

int hdlcFrame(uint8_t *outbuf, size_t outbuf_len, ax25_ctx_t *ctx, ax25_frame_t *pkg) {
    int i, j;
    int idx = 0;
    uint8_t info[AX25_FRAME_MAX_SIZE];

    ctx->crc_out = CRC_CCIT_INIT_VAL;

    for (i = 0; i < 10; i++)
        pkg->header[i].ssid &= 0xFE; // clear all end-of-path bits
    for (i = 1; i < 10; i++) {
        if (pkg->header[i].addr[0] == 0x00) {
            pkg->header[i - 1].ssid |= 0x01;
            break;
        }
    }

    for (i = 0; i < 10; i++) {
        if (pkg->header[i].addr[0] == 0)
            break;
        for (j = 0; j < 6; j++) {
            // Callsigns shorter than six characters are padded with spaces,
            // and every address byte is shifted left one place to leave room
            // for the end-of-path bit AX.25 keeps in the low bit.
            uint8_t data = (uint8_t)pkg->header[i].addr[j];
            if (data == 0)
                data = 0x20;
            data <<= 1;
            if (idx >= (int)sizeof(info))
                return 0;
            ax25_putRaw(&info[idx++], ctx, data);
        }
        if (idx >= (int)sizeof(info))
            return 0;
        ax25_putRaw(&info[idx++], ctx, (uint8_t)pkg->header[i].ssid);
        if (pkg->header[i].ssid & 0x01)
            break;
    }

    ax25_putRaw(&info[idx++], ctx, AX25_CTRL_UI);      // APRS UI frame, Poll/Final bit clear
    ax25_putRaw(&info[idx++], ctx, AX25_PID_NOLAYER3); // 0xF0 - no layer 3

    for (i = 0; i < (int)strlen(pkg->data); i++) {
        if (idx >= (int)sizeof(info))
            break;
        ax25_putRaw(&info[idx++], ctx, (uint8_t)pkg->data[i]);
    }

    if ((size_t)idx > outbuf_len)
        return 0;

    memcpy(outbuf, info, (size_t)idx);
    return idx;
}
